def area(r):
    '''
    Возвращает площадь круга радиуса r.

        Параметры:
            r: радиус круга

        Возвращаемое значение:
            площадь круга (pi * r^2)

    Например, при area(3) вернёт 28.274...
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности радиуса r.

        Параметры:
            r: радиус окружности

        Возвращаемое значение:
            длина окружности (2 * pi * r)

    Например, при perimeter(3) вернёт 18.849...
    '''
    return 2 * math.pi * r