def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a и b.

        Параметры:
            a: длина прямоугольника
            b: ширина прямоугольника

        Возвращаемое значение:
            площадь прямоугольника (a * b)

    Например, при area(3, 4) вернёт 12
    '''
    return a * b 


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a и b.

        Параметры:
            a: длина прямоугольника
            b: ширина прямоугольника

        Возвращаемое значение:
            периметр прямоугольника ((a + b) * 2)

    Например, при perimeter(3, 4) вернёт 14
    '''
    return (a + b) * 2