def area(a):
    '''
    Возвращает площадь квадрата со стороной a.

        Параметры:
            a: длина стороны квадрата

        Возвращаемое значение:
            площадь квадрата (a * a)

    Например, при area(5) вернёт 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.

        Параметры:
            a: длина стороны квадрата

        Возвращаемое значение:
            периметр квадрата (4 * a)

    Например, при perimeter(5) вернёт 20
    '''
    return 4 * a