def area(a, h): 
    '''
    Возвращает площадь треугольника со стороной a и высотой h, которая идет от вершины, не принадлежащей стороне a
    
        Параметры:
            a - сторона a
            h - высота треугольника, которая идет от вершины, не принадлежащей стороне a
    Например, при area(3, 4) вернет 6
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника со сторонами a, b, c

        Параметры:
            a - первая сторона треугольника
            b - вторая сторона треугольника
            c - третья сторона треугольника
    Например, при perimeter(1, 3, 5) вернет 9
    '''
    return a + b + c 
